Documents/CRM_СобытияПоРабочимЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_СобытияПоРабочимЛистам</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершеноУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаВыдачу</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаТестДрайв</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаПродажуАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_СобытияПоРабочимЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛидПрикрепленный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтомобилиДляВыдачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/CRM_СобытияПоРабочимЛистам/Ext/ManagerModule.bsl
Функция ПолучитьБлижайшуюДатуДР(ДатаРождения) Экспорт
	ДеньРождения = День(ДатаРождения);
	ДеньРождения = ?(ДеньРождения < 10, "0" + ДеньРождения, Строка(ДеньРождения));
	
	МесяцРождения = Месяц(ДатаРождения);
	МесяцРождения = ?(МесяцРождения < 10, "0" + МесяцРождения, Строка(МесяцРождения));

	ТекущаяДата = ТекущаяДата();
	
	ТекущийГод = Формат(Год(ТекущаяДата), "ЧГ=");

	Если МесяцРождения ="02" и  ДеньРождения = "29" тогда
		МесяцРождения ="03";
		ДеньРождения = "01";
	КонецЕсли;

	ДатаРожденияТекущийГод = Дата(ТекущийГод + МесяцРождения + ДеньРождения);
	
	Если ДатаРожденияТекущийГод < ТекущаяДата Тогда
		ДатаРожденияТекущийГод = ДобавитьМесяц(ДатаРожденияТекущийГод, 12);
	КонецЕсли;
	
	Возврат НачалоДня(ДатаРожденияТекущийГод);	
КонецФункции

Процедура СоздатьЗадачуОЗаписиКлиентаНаДиагностику(Ссылка, Менеджер, IDK) Экспорт
		
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.IDK = IDK;
	СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ОценкаТрейдИн;
	Если ТипЗнч(Менеджер) = Тип("СправочникСсылка.CRM_Отделы") Тогда
		СобытиеОбъект.Отдел = Менеджер;
	Иначе
		СобытиеОбъект.Сотрудник = Менеджер;
	КонецЕсли;
	СобытиеОбъект.ДилерскийЦентр = Ссылка.ДилерскийЦентр;
	СобытиеОбъект.ДоговорНаПродажуАвтомобиля = Ссылка.ДоговорНаПродажуАвтомобиля;
	СобытиеОбъект.Подразделение = Ссылка.Подразделение;
	СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
	СобытиеОбъект.Дата = ТекущаяДата();
	СобытиеОбъект.ДатаНапоминания = Ссылка.ДатаНапоминания;
	СобытиеОбъект.Комментарий = "РЛ "+IDK + ": "+Ссылка.Комментарий;
	СобытиеОбъект.Обработано = Ложь;
	СобытиеОбъект.ЗавершеноУспешно = Ложь;
	СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	Напоминание.Отправитель = ПараметрыСеанса.Пользователь.Сотрудник;
	Напоминание.Подробнее = СобытиеОбъект.Ссылка;
	Если ТипЗнч(Менеджер) = Тип("СправочникСсылка.CRM_Отделы") Тогда
		Напоминание.Адресаты.Добавить().Отдел = Менеджер;
	Иначе
		Напоминание.Адресаты.Добавить().Сотрудник = Менеджер;
	КонецЕсли;
	Напоминание.ДатаОтправки = ТекущаяДата();
	Напоминание.Комментарий = Ссылка.Комментарий;
	Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.ЗадачаОЗаписиНаДиагностику;
	Напоминание.ПоказыватьС = ТекущаяДата();
	Напоминание.ПоказыватьПо = Ссылка.ДатаНапоминания;
	Напоминание.Наименование = IDK;
	Напоминание.ИдентификаторОбъекта = Строка(Формат(IDK,"ЧГ="));
	Напоминание.Сообщение = "Задача о записи на диагностику по РЛ " + IDK;
	Напоминание.Записать();

КонецПроцедуры

Процедура СоздатьЗвонокВежливостиПослеВыдачи (Событие = Неопределено,Выдача = Неопределено) Экспорт
	Если Событие = Неопределено И Выдача = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Козлов Е.А. Начало 20.07.2016
	Если Событие.ЗвонокНомер = "Звонок ДР" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.Клиент.ДатаРождения КАК ДатаРождения,
		|	Renault_РабочиеЛисты.Отдел КАК Отдел,
		|	Renault_РабочиеЛисты.Подразделение КАК Подразделение,
		|	Renault_РабочиеЛисты.ДилерскийЦентр КАК ДилерскийЦентр
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ
		|	Renault_РабочиеЛисты.IDK = &IDK";	
		Запрос.УстановитьПараметр("IDK", Выдача.IDK);	
		Результат = Запрос.Выполнить(); 	
		Выборка = Результат.Выбрать(); 	
		Выборка.Следующий(); 
		
		КлиентДатаРождения = Выборка.ДатаРождения;
		
		Если ЗначениеЗаполнено(КлиентДатаРождения) Тогда
			ДатаЗвонкаДР = Документы.CRM_СобытияПоРабочимЛистам.ПолучитьБлижайшуюДатуДР(КлиентДатаРождения); 		
			
			Если ЗначениеЗаполнено(ДатаЗвонкаДр) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	CRM_СобытияПоРабочимЛистам.Ссылка
				|ИЗ
				|	Документ.CRM_СобытияПоРабочимЛистам КАК CRM_СобытияПоРабочимЛистам
				|ГДЕ
				|	CRM_СобытияПоРабочимЛистам.IDK = &РабочийЛист
				|	И CRM_СобытияПоРабочимЛистам.ВидСобытия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыСобытий.ЗвонокВежливостиДР)
				|	И CRM_СобытияПоРабочимЛистам.Обработано = ЛОЖЬ
				|	И CRM_СобытияПоРабочимЛистам.ДатаНапоминания = &ДатаНапоминания
				|
				|УПОРЯДОЧИТЬ ПО
				|	CRM_СобытияПоРабочимЛистам.ДатаНапоминания";
				Запрос.УстановитьПараметр("РабочийЛист", Выдача.IDK);
				Запрос.УстановитьПараметр("ДатаНапоминания", ДатаЗвонкаДР);
				Результат = Запрос.Выполнить();
				
				Если Результат.Пустой() Тогда 				
					СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
					СобытиеОбъект.IDK = Выдача.IDK;
					СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиДР;
					СобытиеОбъект.Сотрудник =  Выдача.Менеджер;
					СобытиеОбъект.Отдел = Выборка.Отдел;
					СобытиеОбъект.ДилерскийЦентр = Выборка.ДилерскийЦентр;
					СобытиеОбъект.Подразделение =  Выборка.Подразделение;
					СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
					СобытиеОбъект.Дата = ТекущаяДата();
					СобытиеОбъект.ДатаНапоминания = ДатаЗвонкаДР;
					СобытиеОбъект.Комментарий = "Звонок на день рождения";
					СобытиеОбъект.Обработано = Ложь;
					СобытиеОбъект.ЗавершеноУспешно = Ложь;
					СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);					
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
		Возврат;

	КонецЕсли;	
	//Козлов Е.А. Конец
	
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.Дата = ТекущаяДата();
	СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
	СобытиеОбъект.ДатаНапоминания = СобытиеОбъект.Дата  + Событие.КоличествоДней*60*60*24;
	СобытиеОбъект.IDK = Выдача.IDK;
	СобытиеОбъект.ДилерскийЦентр = Выдача.ДилерскийЦентр;
	СобытиеОбъект.Подразделение = Выдача.Менеджер.Подразделение;
	СобытиеОбъект.Отдел = Renault_CRM.ПолучитьОтделСотрудника(Выдача.Менеджер);
	Если СокрЛП(Событие.ЗвонокНомер) = "Звонок №1" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости3;
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";
	ИначеЕсли СокрЛП(Событие.ЗвонокНомер) = "Звонок №2" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости30; 
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";
	ИначеЕсли СокрЛП(Событие.ЗвонокНомер) = "Звонок №3" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости360;   
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";		
	// Беседин 19.10.21 заявка 1082
	ИначеЕсли НЕ СокрЛП(Событие.ЗвонокНомер) = "Звонок ДР" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиНовый;
		СобытиеОбъект.Комментарий = "Звонок вежливости "+СокрЛП(Событие.ЗвонокНомер) + " "+Событие.КоличествоДней + " д.";
	КонецЕсли;
	СобытиеОбъект.Сотрудник = Выдача.Менеджер;
	СобытиеОбъект.Обработано = Ложь;
	СобытиеОбъект.ЗавершеноУспешно = Ложь;
	//СобытиеОбъект.Отдел = Отдел;
	//СобытиеОбъект.Подразделение = Подразделение;					
	СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция ПеренестиСобытие (Событие=Неопределено) Экспорт
	Если Событие = Неопределено  Тогда
		Возврат(Неопределено);
	КонецЕсли;
	СобытиеОбъект = Событие.ПолучитьОбъект();
	Док=Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Док,СобытиеОбъект);
	Для Каждого ТЧ Из СобытиеОбъект.Метаданные().ТабличныеЧасти Цикл Док[ТЧ.Имя].Загрузить(СобытиеОбъект[ТЧ.Имя].Выгрузить()) КонецЦикла;
	Док.Номер="";
	Док.Основание=Событие.Ссылка;
	Док.Обработано=Ложь;
	Док.ДатаЗакрытия="";
	Док.АвторЗакрытия="";
	Док.ЗавершеноУспешно=Ложь;
	
	//Док.ПолучитьФорму("ФормаСозданияСобытия").ОткрытьМодально();
	Форма=Док.ПолучитьФорму("ФормаСозданияСобытия");
	Форма.ЭтоПерепланирование=Истина; 
	СсылкаНового=Форма.ОткрытьМодально();
	Если СсылкаНового <> Неопределено Тогда 
		СобытиеОбъект.КомментарийЗакрытия="Перенесено на "+Формат(СсылкаНового.ДатаНапоминания,"ДФ=dd.MM.yyyy");
		СобытиеОбъект.ЗавершеноУспешно = Ложь;
		СобытиеОбъект.Обработано = Истина;
		СобытиеОбъект.ДатаЗакрытия= ТекущаяДата();
		СобытиеОбъект.АвторЗакрытия = ПараметрыСеанса.Пользователь.Сотрудник;
		СобытиеОбъект.Записать();
		Возврат(СсылкаНового);
	КонецЕсли;
	Возврат(Неопределено);
	
КонецФункции
